# Pandas - Operations on Rows (axis = 1)

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame({'A' : [1 ,1, 2, 2, 3], 'B': ['a', 'a', 'c', 'd', 'e'], 'NUM': [10, 20, 30, 40, 50 ]})
df

   A  B  NUM
0  1  a   10
1  1  a   20
2  2  c   30
3  2  d   40
4  3  e   50

### Add rows

### Insert rows

### Delete rows

In [5]:
# drop row by index number
df3 = df.drop(1) # drops the second record but does not modify current dataframe
df3

   A  B  NUM
0  1  a   10
2  2  c   30
3  2  d   40
4  3  e   50

In [6]:
df4 = df.drop([1,2]) # drop multiple rows
df4

   A  B  NUM
0  1  a   10
3  2  d   40
4  3  e   50

#### Delete rows by condition

In [9]:
out = df.drop(df[df.A == 2].index)
out

   A  B  NUM
0  1  a   10
1  1  a   20
4  3  e   50

### Filter rows

#### Simple conditions

In [6]:
df1 = df['NUM'] > 20
df1

0    False
1    False
2     True
3     True
4     True
Name: NUM, dtype: bool

In [7]:
df[df['NUM'] > 20]

   A  B  NUM
2  2  c   30
3  2  d   40
4  3  e   50

#### Complex conditions

In [11]:
df[(df['NUM'] > 20) & (df['A'] == 3)] # brackets are neccessary!!!

   A  B  NUM
4  3  e   50